In [1]:
import pandas as pd

# Create a DataFrame from the sales_data csv file located online
df = pd.read_csv("https://github.com/dgregg/Jupyter/blob/master/Notebooks/data/sales_data.csv")

In [2]:
# Calculating the standard deviation for an entire dataframe
print(df.std(numeric_only=True))

Quantity      1.417413
Sales       719.281639
Age          15.028258
dtype: float64

In [3]:
# Calculating skewness using .skew()
print(df.skew(numeric_only=True))

Quantity   -0.003226
Sales       1.084130
Age        -0.000329
dtype: float64

In [4]:
# Using the Pandas .describe() method
display(df.describe())

           Quantity         Sales           Age
count  16684.000000  16684.000000  16684.000000
mean       3.007193    857.978725     43.500719
std        1.417413    719.281639     15.028258
min        1.000000     40.660000     18.000000
25%        2.000000    203.300000     30.000000
50%        3.000000    600.170000     44.000000
75%        4.000000   1200.340000     57.000000
max        5.000000   3000.850000     69.000000

In [5]:
# Getting Unique Values in the region Column
print(df['Region'].unique())

['South' 'North' 'West' 'East']

In [8]:
# Calculate total sales for each product type
total_sales = df.groupby('Type')['Sales'].sum()

# Print out the results
print("Total Sales by Type")
display(total_sales)

Total Sales by Type

Type
Books & Toys          54709.92
Clothing & Shoes    1821404.27
Technology           614250.00
Name: Sales, dtype: float64

In [7]:
# Creating Your First Crosstab
tab = pd.crosstab(
    index=df['Region'],
    columns=df['Category'],
)

display(tab)

Category  Clothing  Cosmetics  Shoes
Region
East          2556       1119    761
North         2601       1169    736
South         1965        827    563
West          2533       1096    758

In [9]:
# Aggregating Sales Using a Pandas Crosstab
tab = pd.crosstab(
    index=df['Region'],
    columns=df['Category'],
    values=df['Sales'],
    aggfunc='sum'
)

display(tab)

Category    Clothing  Cosmetics       Shoes
Region
East      2309415.68  132551.60  1359985.22
North     2335222.56  143936.40  1341379.95
South     1780374.64  102747.82  1037693.93
West      2273406.08  136617.60  1361185.56